#include "convert.h"

/******************************************************************************************
 * 进制转换
 ******************************************************************************************/
int main ( int argc, char* argv[] ) {
   for ( int i = 1; i < argc; i += 2 ) {
      __int64 n = _atoi64 ( argv[i] ); //待转换的十进制数
      int base = atoi ( argv[i+1] ); //目标进制
      Stack<char> S; //用栈记录转换得到的各数位
      convert ( S, n, base ); //进制转换
      while ( !S.empty() ) printf ( "%c", ( S.pop() ) ); //逆序输出栈内数位，即正确结果
   }
   return 0;
}




